using System.Collections;
using System.Collections.Generic;
using UnityEngine;


public class State {
    public int Peoples;
    public int Ammunition;
    public int Money;
    public int WinPoints;
}

public class Choise {
    public string Description;
    public string Сareful;
    public string СarefulResult;
    public State СarefulChange;
    public string Risky;
    public string RiskyWin;
    public State RiskyWinChange;
    public string RiskyFail;
    public State RiskyFailChange;

    public Choise(
        string desctiption,
        string careful,
        string carefulResult,
        int carefulChange1,
        int carefulChange2,
        int carefulChange3,
        int carefulChange4,
        string risky,
        string riskyWin,
        int riskyWinChange1,
        int riskyWinChange2,
        int riskyWinChange3,
        int riskyWinChange4,
        string riskyFail,
        int riskyFailChange1,
        int riskyFailChange2,
        int riskyFailChange3,
        int riskyFailChange4
        ) {

        Description = desctiption;
        Сareful = careful;
        СarefulResult = carefulResult;
        СarefulChange = new State() { Peoples = carefulChange1, Ammunition = carefulChange2, Money = carefulChange3, WinPoints = carefulChange4 };
        Risky = risky;
        RiskyWin = riskyWin;
        RiskyWinChange = new State() { Peoples = riskyWinChange1, Ammunition = riskyWinChange2, Money = riskyWinChange3, WinPoints = riskyWinChange4 };
        RiskyFail = riskyFail;
        RiskyFailChange = new State() { Peoples = riskyFailChange1, Ammunition = riskyFailChange2, Money = riskyFailChange3, WinPoints = riskyFailChange4 };
    }

    public static Choise[] GetWarBase() {
        return new Choise[] {
            new Choise("Проникновение на склад","Проникнуть ночью в воскресенье","Проникновение прошло успешно, но мы получили только накладные на продукты и обмундирование. Важные документы на ночь уносят в штаб",-3,-3,0,2,"Незаметно проникнуть в грузовике с продуктами","Агент успешно прошерстил склад и вывез несколько пачек документов на том же грузовике! Осталось отряхнуть их от муки - и можно составить доклад командованию!",0,-2,0,6,"Вашего агента арестовали! Бдительный караул внезапно решил проверить мешки с мукой!",-1,-2,0,0),
            new Choise("Проникновение в штаб","Проникнуть ночью в выходной","Проникновение прошло успешно, но мы получили только документы о подвозе топлива. Важные документы убирают в выходные в защищенное хранилище.",-2,-1,0,0,"Переодеться офицером","Успех",0,-1,0,8,"Неудача",-2,-3,0,4),
            new Choise("Захват караула","Незаметно захватить отдельного солдата, когда он отойдет по нужде","Солдат знал не очень много, но раскололся быстро.",0,-3,0,2,"Захватить караул с применением оружия.","Успех",0,-3,0,10,"Неудача",-1,-1,0,2),
            new Choise("Перехват курьера","Аккуратность","Аккуратный исход",-1,-1,0,4,"Риск","Успех",0,-1,-1,2,"Неудача",-2,-2,0,0),
            new Choise("Захват офицера","Аккуратность","Аккуратный исход",-1,-1,0,2,"Риск","Успех",0,-2,0,4,"Неудача",-2,-2,0,2),
            new Choise("Похищение ценных бумаг из канцелярии","Аккуратность","Аккуратный исход",-1,-2,0,0,"Риск","Успех",0,-2,0,6,"Неудача",-3,-3,0,4),
            new Choise("Проникновение на склад","Аккуратность","Аккуратный исход",0,-3,0,4,"Риск","Успех",0,-3,1,6,"Неудача",-3,-2,0,2),
            new Choise("Проникновение в штаб","Аккуратность","Аккуратный исход",-2,-2,0,0,"Риск","Успех",0,-2,0,4,"Неудача",-1,-2,0,0),
            new Choise("Захват караула","Аккуратность","Аккуратный исход",-3,-3,0,4,"Риск","Успех",0,-1,0,6,"Неудача",-3,-2,0,2),
            new Choise("Захват офицера","Аккуратность","Аккуратный исход",-2,-1,0,2,"Риск","Успех",0,-3,0,8,"Неудача",-2,-1,0,4),
        };
    }

    public static Choise[] GetPort() {
        return new Choise[] {
            new Choise("Проникновение на флагман флота","Аккуратность","Аккуратный исход",0,-1,0,0,"Риск","Успех",0,0,0,4,"Неудача",-1,-1,0,2),
            new Choise("Помощь в проникновении диверсионной группы","Аккуратность","Аккуратный исход",0,0,0,2,"Риск","Успех",0,0,0,2,"Неудача",0,-2,0,0),
            new Choise("Саботаж на транспорте","Аккуратность","Аккуратный исход",0,-1,0,0,"Риск","Успех",0,0,0,2,"Неудача",0,0,0,0),
            new Choise("Саботаж на производстве торпед","Аккуратность","Аккуратный исход",0,0,0,2,"Риск","Успех",0,-2,0,2,"Неудача",-2,-2,0,2),
            new Choise("Проникновение в ставку флота","Аккуратность","Аккуратный исход",0,-1,0,0,"Риск","Успех",0,-1,0,4,"Неудача",-1,-1,0,2),
            new Choise("Захват Адмирала","Аккуратность","Аккуратный исход",0,-2,0,2,"Риск","Успех",0,-2,0,4,"Неудача",-2,-2,0,2),
            new Choise("Саботаж на транспорте","Аккуратность","Аккуратный исход",0,-1,0,2,"Риск","Успех",0,-1,0,2,"Неудача",-1,-1,0,0),
            new Choise("Саботаж на производстве торпед","Аккуратность","Аккуратный исход",0,-2,0,0,"Риск","Успех",0,-1,0,2,"Неудача",-1,0,0,0),
            new Choise("Проникновение в ставку флота","Аккуратность","Аккуратный исход",0,0,0,2,"Риск","Успех",0,-1,0,4,"Неудача",0,0,0,0),
            new Choise("Захват Адмирала","Аккуратность","Аккуратный исход",0,-2,0,0,"Риск","Успех",0,-2,0,4,"Неудача",-2,-1,0,2),
        };
    }

    public static Choise[] GetGov() {
        return new Choise[] {
            new Choise("Проникновение в кабинет министра","Аккуратность","Аккуратный исход",-2,0,-2,2,"Риск","Успех",0,0,-2,6,"Неудача",-1,0,-2,0),
            new Choise("Захват казначея","Аккуратность","Аккуратный исход",-3,0,-3,0,"Риск","Успех",0,0,-1,4,"Неудача",-2,0,-3,4),
            new Choise("Проникновение в канцелярию премьер-министра","Аккуратность","Аккуратный исход",-2,0,-1,2,"Риск","Успех",0,0,-3,6,"Неудача",-1,0,-1,2),
            new Choise("Проникновение в кабинет министра","Аккуратность","Аккуратный исход",-3,0,-3,4,"Риск","Успех",0,0,-1,6,"Неудача",-2,0,-2,0),
            new Choise("Захват казначея","Аккуратность","Аккуратный исход",-2,0,-1,2,"Риск","Успех",0,0,-2,8,"Неудача",-2,0,-2,2),
            new Choise("Проникновение в канцелярию премьер-министра","Аккуратность","Аккуратный исход",0,0,-3,0,"Риск","Успех",0,0,-2,10,"Неудача",-3,0,-3,4),
            new Choise("Проникновение в канцелярию премьер-министра","Аккуратность","Аккуратный исход",-1,0,-1,4,"Риск","Успех",0,0,-3,2,"Неудача",-3,0,-2,2),
            new Choise("Проникновение в кабинет министра","Аккуратность","Аккуратный исход",-1,0,-1,0,"Риск","Успех",0,0,-2,4,"Неудача",-1,0,-2,0),
            new Choise("Захват казначея","Аккуратность","Аккуратный исход",-1,0,-2,4,"Риск","Успех",0,0,-1,6,"Неудача",-3,0,-2,2),
            new Choise("Проникновение в канцелярию премьер-министра","Аккуратность","Аккуратный исход",0,0,-3,2,"Риск","Успех",0,0,-3,8,"Неудача",-2,0,-1,4),
        };
    }

    public static Choise[] GetCity() {
        return new Choise[] {
            new Choise("Пленение офицера","Аккуратность","Аккуратный исход",0,0,-1,2,"Риск","Успех",0,0,0,2,"Неудача",-2,0,-1,2),
            new Choise("Теракт","Аккуратность","Аккуратный исход",0,0,-2,2,"Риск","Успех",0,0,-1,4,"Неудача",-1,0,-2,0),
            new Choise("Роспуск слухов","Аккуратность","Аккуратный исход",0,0,0,0,"Риск","Успех",0,0,-1,4,"Неудача",-2,0,0,0),
            new Choise("Ограбление курьера","Аккуратность","Аккуратный исход",0,0,-2,2,"Риск","Успех",0,0,-2,2,"Неудача",-1,0,-2,2),
            new Choise("Нападение на патруль","Аккуратность","Аккуратный исход",0,0,0,0,"Риск","Успех",0,0,0,2,"Неудача",-1,0,-1,2),
            new Choise("Пленение офицера","Аккуратность","Аккуратный исход",0,0,-1,0,"Риск","Успех",0,0,0,4,"Неудача",0,0,-2,2),
            new Choise("Теракт","Аккуратность","Аккуратный исход",0,0,0,2,"Риск","Успех",0,0,-2,4,"Неудача",-2,0,-1,0),
            new Choise("Роспуск слухов","Аккуратность","Аккуратный исход",0,0,-1,0,"Риск","Успех",0,0,-1,2,"Неудача",-1,0,0,0),
            new Choise("Ограбление курьера","Аккуратность","Аккуратный исход",0,0,-2,2,"Риск","Успех",0,0,-2,2,"Неудача",0,0,0,0),
            new Choise("Нападение на патруль","Аккуратность","Аккуратный исход",0,0,-1,0,"Риск","Успех",0,0,-1,4,"Неудача",0,0,-1,2),
        };
    }
}